app/controllers/tareas_controller.rb

SELECT `tareas`.* FROM `tareas`
---
    def index
      @tareas=Tarea.all