app/controllers/welcome_controller.rb

SELECT  `usuarios`.* FROM `usuarios` LIMIT 1
SELECT `tareas`.* FROM `tareas`
---
  def index
    @usuarios=Usuario.all
    @tareas=Tarea.all

SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`usu_nombre` = 'Administrador' AND `usuarios`.`usu_password` = 'admin' LIMIT 1
SELECT  `usuarios`.* FROM `usuarios` LIMIT 1
---
  def new
    @var_session = params[:session]
    @var_usuario_elegido = @var_session['usuario_elegido']
    @var_password_escrito = @var_session['password_escrito']

    if user = Usuario.find_by(usu_nombre: @var_usuario_elegido, usu_password: @var_password_escrito) #le paso los datos del form y busco en el modelo usuarios
      session[:current_user_id] = user.usu_id
      redirect_to tareas_path
    else
      @usuarios=Usuario.all #para que no me de error cuando hago el render sin declarar la variable que ya tengo en el method index de este controller